src/cf/InformationRegisters/инт_СообщенияКУдалению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_СообщенияКУдалению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_НаправлениеПотокаДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_ИсходныеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СформированноеСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/инт_НаправлениеПотокаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_НаправлениеПотокаДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/инт_СообщенияКУдалению/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_СообщенияКУдалению
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Процедура - Зарегистрировать сообщение к удалению
// Ставит сообщение в очередь удаления.
// Параметры:
//  ИдентификаторСообщения	 - 	УникальныйИдентификатор - ИдентификаторСообщения которое необходимо удалить из очередей.
//  НаправлениеПотока		 - ПеречислениеСсылка.инт_НаправлениеПотокаДанных	 -  Направление потока данных.
//
Процедура ЗарегистрироватьСообщениеКУдалению(ИдентификаторСообщения, НаправлениеПотока) Экспорт
	Если НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий Тогда
		Менеджер = РегистрыСведений.инт_ОчередьИсходящихСообщений;
	ИначеЕсли НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Входящий Тогда
		Менеджер = РегистрыСведений.инт_ОчередьВходящихСообщений;
	Иначе
		ВызватьИсключение "Ошибка при попытке зарегистрировать сообщение к удалению";
	КонецЕсли;
	
	ДанныеОСообщении = Менеджер.ПолучитьДанныеОчередиПоИдентификатору(ИдентификаторСообщения, "ПотокДанных");
	ДнейДоУдаления = ДанныеОСообщении.ПотокДанных.УдалятьОбработанныеСообщенияЧерез;
	
	Если ДнейДоУдаления > 0 Тогда
		Запись = РегистрыСведений.инт_СообщенияКУдалению.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторСообщения = ИдентификаторСообщения;
		Запись.НаправлениеПотока = НаправлениеПотока;
		Запись.ДатаУдаления = ТекущаяУниверсальнаяДата()+86400*ДнейДоУдаления;
		Запись.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура ОчиститьОчередьИсходящихСообщений() Экспорт
	МассивИдентификаторов = ПолучитьМассивИдентификаторовКУдалению(Перечисления.инт_НаправлениеПотокаДанных.Исходящий);
	
	Для Каждого Идентификатор Из МассивИдентификаторов Цикл
		НачатьТранзакцию();
		Попытка
			РегистрыСведений.инт_ОчередьИсходящихСообщений.УдалитьСообщениеИзОчередиПоИдентификатору(Идентификатор);
			
			Запись = РегистрыСведений.инт_СообщенияКУдалению.СоздатьМенеджерЗаписи();
			Запись.ИдентификаторСообщения = Идентификатор;
			Запись.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Исходящий;
			Запись.Удалить();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			СообщениеОбОшибке = СтрШаблон("При попытке удаления сообщения с идентификатором <%1> из очереди исходящих, возникла ошибка!
			|
			| Информация об ошибке: %2", Идентификатор, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		    ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.СообщенияКУдалению", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
		КонецПопытки;
			
	КонецЦикла;
КонецПроцедуры

Процедура ОчиститьОчередьВходящихСообщений() Экспорт
	МассивИдентификаторов = ПолучитьМассивИдентификаторовКУдалению(Перечисления.инт_НаправлениеПотокаДанных.Входящий);
	
	Для Каждого Идентификатор Из МассивИдентификаторов Цикл
		НачатьТранзакцию();
		Попытка
			РегистрыСведений.инт_ОчередьВходящихСообщений.УдалитьСообщениеИзОчередиПоИдентификатору(Идентификатор);
			
			Запись = РегистрыСведений.инт_СообщенияКУдалению.СоздатьМенеджерЗаписи();
			Запись.ИдентификаторСообщения = Идентификатор;
			Запись.НаправлениеПотока = Перечисления.инт_НаправлениеПотокаДанных.Входящий;
			Запись.Удалить();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			СообщениеОбОшибке = СтрШаблон("При попытке удаления сообщения с идентификатором <%1> из очереди входящих, возникла ошибка!
			|
			| Информация об ошибке: %2", Идентификатор, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		    ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.СообщенияКУдалению", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
		КонецПопытки;
			
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьМассивИдентификаторовКУдалению(НаправлениеПотока)

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	инт_СообщенияКУдалению.ИдентификаторСообщения КАК ИдентификаторСообщения
               |ИЗ
               |	РегистрСведений.инт_СообщенияКУдалению КАК инт_СообщенияКУдалению
               |ГДЕ
               |	инт_СообщенияКУдалению.НаправлениеПотока = &НаправлениеПотока
               |	И инт_СообщенияКУдалению.ДатаУдаления <= &ТекущийМомент";
Запрос.УстановитьПараметр("НаправлениеПотока",НаправлениеПотока);
Запрос.УстановитьПараметр("ТекущийМомент", ТекущаяУниверсальнаяДата());
Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторСообщения");
КонецФункции

#КонецОбласти

#КонецЕсли
